#!/usr/bin/perl
#在一般語言裡，數字與字串是無法相加的，但在Perl之中將其皆視為純量，所以單純看運算元來決定純量當時應該視為數字還是字串
###########################################################################
$a=123;
$b="456";
print $a+$b, "\n";
print $a.$b, "\n";
###########################################################################
#定義陣列
@student=("9154610","9154611",9154612);

print $student[0],"\n";
print "$student[1]\n";
print $student[2]."\n";

#陣列專屬的特殊變數
print "此陣列的最後駐標為 " . $#student , "\n";
print "此陣列的個數為 " , $#student+1 , "\n";

#顯示連續內容
print @student,"\n";
#內容以空格區分
print "@student\n";
###########################################################################
# 特殊陣列 @ARGV
#不需如此設定 : @ARGV=("a","b","c");

print $ARGV[0],"\n";
print $ARGV[1],"\n";
print $ARGV[2],"\n";
print "您輸入的參數個數為", $#ARGV+1 , "\n";
###########################################################################
# $純量 = 單一 = 單數
# @陣列 = 串列 = 複數
# %雜湊 = 串列 = 複數

#定義陣列 = 類似ip
@students=("9154610","9154611",9154612);

#定義雜湊 = 類似dns
%students = ("Peter"=>"9154610" , "Mary"=>"9154611" , "Cathy"=>"9154612");

print $students{"Peter"},"\n";
print $students{"Mary"},"\n";
print $students{"Cathy"},"\n";

print %students,"\n";
###########################################################################
#$_應該是最常用的預設變數了，$_通常代表迭代運算式中每次取出的純量，而無須另外指定變數存放。
@temp=qw/ 001 002 003 004/;
map {$_ =~ s/00/11/;} @temp;
print "@temp\n";
#特別在沒有明確指定對象時，指的就是$_。
@temp=qw/ 001 002 003 004/;
foreach (@temp)      # foreach $a (@temp)
{
      s/00/11/;              # $a =~ s/00/11/;
}
print "@temp\n";
###########################################################################
#foreach 控制結構

#正向取出陣列的元素 
foreach $x ( @ARGV )
{
  print "$x ";
  $sum+=$x; #相加只有10進至相加
}
print $sum,"\n"; 

#反相取出陣列的元素元素 
foreach $x ( reverse @ARGV )
{
  print "$x ";
  $sum+=$x;
}
print $sum,"\n"; 

#預設變數$_
foreach ( @ARGV )
{
  print ; #預設為$_
  print " ";
  $sum+=$_;
}
print $sum,"\n"; 
###########################################################################
#=~可用來將右邊的樣式比對左邊的字串純量，成功傳回1，失敗傳回0。
#表否定則可改用!~。
#通常搭配判斷式使用(if, while,...)，若左邊為預設變數$_，則可省略為 if (/......../) 。

$str ="Perl is write-only language?" ;
if ($str =~ /\w+-/)  #詢問變數 $str 裡面有沒有 \w+- 這個子字串呢?
{
     print "$`\n";     # Perl is
     print "$&\n";     # write-
     print "$'\n";     # only language?
}

#$`代表字串中比對成功之前的部分
#$&代表字串中比對成功的部分
#$'代表字串中比對成功之後的部分	
###########################################################################
$str="All brand names and product names used in this book are trademarks.";
$str =~ /(\w+) names and (\w+) names /;
print $&,"\n"; # brand names and product names
print $1,"\n";  # brand
print $2,"\n";  # product 
###########################################################################
###########################################################################
###########################################################################
